app/controllers/job_applications_controller.rb

    def index
        @job_applications = JobApplication.all
---
SELECT "job_applications".* FROM "job_applications"

    def create
        @job_application = JobApplication.create!(job_application_params)
---
INSERT INTO "job_applications" ("cover_letter", "attachment", "created_at", "updated_at", "user_profile_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"