app/controllers/user_profiles_controller.rb

    def index
        @user_profiles = UserProfile.all
---
SELECT "user_profiles".* FROM "user_profiles"